Revit 2027 API
ParameterTypeId.RepeatingDetailNumber Property
 "Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RepeatingDetailNumber { get; }
Public Shared ReadOnly Property RepeatingDetailNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RepeatingDetailNumber {
	ForgeTypeId^ get ();
}
static member RepeatingDetailNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace